[
  {
    "title": "Happy 100 weeks to the first news...",
    "subtitle": "MeyNews is soon becoming 3",
    "body": "Happy 100 weeks to MeyNews and its first news! I created this article here in a computer shop in Cagayan. More updates awaiting soon.",
    "time": 1734851553817
  }, 
  {
    "title": "Happy Halloween!",
    "subtitle": "Details about RSS implementation",
    "body": "I have introduced the RSS support to MeyNews. It isnt working just yet. it shows something like\n\n<code>\n&lt;?xml version='1.0' encoding='UTF-8'>...\n</code>\n\nStay tuned for the next update.",
    "time": 1730294085210
  }, 
  {
    "title": "Adding RRS Support",
    "subtitle": "Making MeyNews more customizable",
    "body": "Today I have planned to make RSS support for the app. This is really great news because it will make MeyNews your very own! During the beta feature of the RSS feature it will only support one feed at a time, but it will increase soon as the feature gets updated. After this I will prepare an architecture change for the body. This will be a lot of work, but the support for images and other types an be introduced!",
    "time": 1730115825279
  }, 
  {
    "title": "Made a new tool for MeyNews",
    "subtitle": "This could help making articles easier",
    "body": "So I made the MeyNews Article Helper on my laptop, which is currently private and is only for me. If you want the source code and you want to take a look at the source code and how it works, contact me at GitHub @princej69, YouTube MaveriaSatiria (@maver2970). I have no school tomorrow due to the typhoon Kristine. I would still be working on Vanton.",
    "time": 1729597361203
  }, 
  {
    "title":"Working on Vanton",
    "subtitle":"This was planned a couple months ago",
    "body":"I saw some libGDX projects then I remember than Vanton is going to be written in libGDX so my mind had the Idea to develop Vanton. I thought of planning to create Vanton some months ago, at least 5 months ago. The classic version of Vanton will show the game screen. The default character (Placeholderball) will be used. By the way on my slow laptop, I made some prototypes of Vanton. Soon I would work on Barebones TD also in LibGDX, but it will be postponed to a future date.",
    "time": 1729420670732
  },
  {
    "title":"Introducing Barebones TD",
    "subtitle":"A very simple tower defense game",
    "body":"Today I made the project Barebones TD which is a tower defense with very basic features, no graphics included, and written in HTML. It is going to start on a Friday because school GRAHHHHH and thats it! Im going to sleep now bye",
    "time": 1729087351031
  },
  {
    "title":"Future Plans",
    "subtitle":"The update could come in November 2024",
    "body":"This article is the first to have subtitles, which is present in most news outlets. I'm not making this a news outlet, it is more like a blog. This includes: \n\n-Adding the subtitles\n-Fixing layout\n-Adding bottom sheet dialog, which has been missing for the past few months\n-More settings\n-And more.\n\nAnd there are some future plans: \n\n- Migrating the data from here to MySQL\n-More planned features.\n\nSee you in Update 7!",
    "time":1728984621305
  },
  {
    "title":"Another app soon",
    "body":"I might make and try to release another app soon. It might start at middle October to early November. It will be a tower defense game I guess, related to what I have recently played, and of course, Infinitode 2. The app or game will release sometime in 2025!",
    "time":1728727651187
  },
  {
    "title":"Important update",
    "body":"Hi there and I would like to show you I haven't made an announcement in a month. By the way if there's a new article, it might be an app's update and idk some changes to my activities idk. Some links will be shared and you can hold and go to the link or copy it.\n\nMuch love,\nMaveriaSatiria",
    "time":1728377235000
  },
  {
    "title":"AFter a long day...",
    "body":"It seems like I once updated the online news here and forgot about it never updating this file again. But now I am so excited that I am bringing up the app after 30 weeks of grave",
    "time":1724975380000
  },
  {
    "title":"HAPPY 1 YEAR TO MEYNEWS!!!!!",
    "body":"Today is January 17, 2024. 1 year after this app was created. Also happy birthday to RSF!",
    "time":1705490906173
  },
  {
    "title": "First News!",
    "body": "I'm so excited to release the first news online!",
    "time": 1704591422670
  }
]
