[
  {
    "title":"Introducing Barebones TD",
    "subtitle":"A very simple tower defense game",
    "body":"Today I made the project Barebones TD which is a tower defense with very basic features, no graphics included, and written in HTML. It is going to start on a Friday because school GRAHHHHH and thats it! Im going to sleep now bye",
    "time": 1729087351031
  },
  {
    "title":"Future Plans",
    "subtitle":"The update could come in November 2024",
    "body":"This article is the first to have subtitles, which is present in most news outlets. I'm not making this a news outlet, it is more like a blog. This includes: \n\n-Adding the subtitles\n-Fixing layout\n-Adding bottom sheet dialog, which has been missing for the past few months\n-More settings\n-And more.\n\nAnd there are some future plans: \n\n- Migrating the data from here to MySQL\n-More planned features.\n\nSee you in Update 7!",
    "time":1728984621305
  },
  {
    "title":"Another app soon",
    "body":"I might make and try to release another app soon. It might start at middle October to early November. It will be a tower defense game I guess, related to what I have recently played, and of course, Infinitode 2. The app or game will release sometime in 2025!",
    "time":1728727651187
  },
  {
    "title":"Important update",
    "body":"Hi there and I would like to show you I haven't made an announcement in a month. By the way if there's a new article, it might be an app's update and idk some changes to my activities idk. Some links will be shared and you can hold and go to the link or copy it.\n\nMuch love,\nMaveriaSatiria",
    "time":1728377235000
  },
  {
    "title":"AFter a long day...",
    "body":"It seems like I once updated the online news here and forgot about it never updating this file again. But now I am so excited that I am bringing up the app after 30 weeks of grave",
    "time":1724975380000
  },
  {
    "title":"HAPPY 1 YEAR TO MEYNEWS!!!!!",
    "body":"Today is January 17, 2024. 1 year after this app was created. Also happy birthday to RSF!",
    "time":1705490906173
  },
  {
    "title": "First News!",
    "body": "I'm so excited to release the first news online!",
    "time": 1704591422670
  }
]
